#+TITLE: Intro to Java Programming
#+AUTHOR: Scott Runnels
#+LANGUAGE: en
#+EXPORT_FILE_NAME: part03b.pdf
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:nil -:nil f:t *:t <:t 
#+BIND: org-latex-caption-above nil
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+LaTeX_CLASS_OPTIONS: [aspectratio=169]
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)
#+BEAMER_THEME: metropolis
# #+BEAMER_OUTER_THEME: miniframes [subsection=false]
#+BEAMER_HEADER: \subtitle{Lists}
# #+BEAMER_HEADER: \AtBeginSection[]{ # This line inserts a table of contents
# #with the current section highlighted at # the beginning of each section
# #+BEAMER_HEADER: \begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame} #
# #In order to have the miniframes/smoothbars navigation bullets even though we
# #do not use subsections # q.v.
# #https://tex.stackexchange.com/questions/2072/beamer-navigation-circles-without-subsections/2078#2078
# #+BEAMER_HEADER: \subsection{} +BEAMER_HEADER: }
#+LATEX_HEADER: \definecolor{myblue}{RGB}{20,105,176}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage[listings, many]{tcolorbox}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usepackage{local-style}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{tcolorbox}[enhanced,colframe=myblue,boxrule=1pt,boxsep=1pt,left=1pt,right=1pt,top=-0pt,bottom=0pt,arc=0pt,toprule=0pt, rightrule=0pt,colback=white,attach boxed title to top left={yshift=-0pt},title=Code,boxed title style={colback=myblue, right=0mm, bottomrule=0pt, left=0mm, arc=0pt}, fonttitle=\tiny]}%
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{tcolorbox}}%
#+LATEX_HEADER: \usepackage{parskip}
*** Getting elements with .get()
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :exports both :wrap resultscode
      ArrayList<String> students = new ArrayList<>();
      students.add("Mawce");
      students.add("Oji");
      students.add("AJ");
      System.out.println(students.get(0));
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Mawce
    #+end_resultscode



*** Left                                                              :BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :exports both :wrap resultscode
      ArrayList<String> teachers = new ArrayList<>();

      teachers.add("Simon");
      teachers.add("Samuel");
      teachers.add("Ann");
      teachers.add("Anna");

      System.out.println(teachers.get(0));
      System.out.println(teachers.get(1));
      System.out.println(teachers.get(2));
      System.out.println(teachers.get(3));
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Simon
    Samuel
    Ann
    Anna
    #+end_resultscode
*** Right                                                             :BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :exports both :wrap resultscode
      ArrayList<String> teachers = new ArrayList<>();

      teachers.add("Simon");
      teachers.add("Samuel");
      teachers.add("Ann");
      teachers.add("Anna");

      System.out.println(teachers.size());
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    4
    #+end_resultscode
    
*** 
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList
      ArrayList<String> students = new ArrayList<>();
      students.add("Mawce");
      students.add("AJ");
      students.add("Oji");
      for (int i = 0; i < students.size(); i++){
          System.out.println("Student: " + students.get(i));
      }
    #+end_src

    #+RESULTS:
    : Student: Mawce
    : Student: AJ
    : Student: Oji

*** Index removal
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :wrap resultscode
      ArrayList<String> list = new ArrayList<>();

      /* Add Elements */
      list.add("First");
      list.add("Second");
      list.add("Third");

      /* Remove an element */
      list.remove(1);

      System.out.println("Index 0 so the first value: " + list.get(0));
      System.out.println("Index 1 so the second value: " + list.get(1));

    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Index 0 so the first value: First
    Index 1 so the second value: Third
    #+end_resultscode


**** Removal by Value
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :wrap resultscode
      ArrayList<String> list = new ArrayList<>();

      /* Add Elements */
      list.add("First");
      list.add("Second");
      list.add("Third");

      /* Remove an element */
      list.remove("Second");

      System.out.println("Index 0: " + list.get(0));
      System.out.println("Index 1: " + list.get(1));

    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Index 0 so the first value: First
    Index 1 so the second value: Third
    #+end_resultscode
**** Removal using Reference Type    
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :wrap resultscode
      ArrayList<Integer> list = new ArrayList<>();

      /* Add Elements */
      list.add(1);
      list.add(2);
      list.add(3);

      /* Remove an element */
      list.remove(Integer.valueOf(2));

      System.out.println("Index 0: " + list.get(0));
      System.out.println("Index 1: " + list.get(1));

    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Index 0 so the first value: 1
    Index 1 so the second value: 3
    #+end_resultscode

** .contains()
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+begin_src java :imports java.util.ArrayList :wrap resultscode
      ArrayList<String> list = new ArrayList<>();

      /* Add Elements */
      list.add("First");
      list.add("Second");
      list.add("Third");

      boolean isMember = list.contains("Second");
      System.out.println("Is Second a member of the list? " + isMember);
      System.out.println("Is Fourth a member of the list? " + list.contains("Fourth"));

    #+end_src

    #+RESULTS:
    #+begin_resultscode
    Is Second a member of the list? true
    Is Fourth a member of the list? false
    #+end_resultscode


** Lists as Method Parameter
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,firstline=3,lastline=7
    #+begin_src java :imports java.util.ArrayList :eval no
      public class Main {

      public static void print(ArrayList<String> list) {
          for (String value: list) {
              System.out.println(value);
          }
      }

          public static void main(String[] args){
              ArrayList<String> strings = new ArrayList<>();

              strings.add("First");
              strings.add("Second");
              strings.add("Third");

              print(strings);

          }
      }
    #+end_src

    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny,firstline=09,lastline=17
    #+begin_src java :imports java.util.ArrayList :exports both :wrap resultscode
      public class Main {

          public static void print(ArrayList<String> list) {
              for (String value: list) {
                  System.out.println(value);
              }
          }

          public static void main(String[] args){
              ArrayList<String> strings = new ArrayList<>();

              strings.add("First");
              strings.add("Second");
              strings.add("Third");

              print(strings);
          }
      }
    #+end_src

    #+RESULTS:
    #+begin_resultscode
    First
    Second
    Third
    #+end_resultscode

*** LEFT                                                              :BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_opt: t    
    :END:
    #+ATTR_LATEX: :options numbersep=5pt,linenos,breaklines=true,fontsize=\tiny
    #+name: pass-by-copy
    #+begin_src java  :imports java.util.ArrayList :exports code
      public class Main {

          public static void print(ArrayList<String> list) {
              for (String value: list) {
                  System.out.println(value);
              }
              list.remove(0);
          }

          public static void main(String[] args){
              ArrayList<String> strings = new ArrayList<>();

              strings.add("First");
              strings.add("Second");
              strings.add("Third");

              print(strings);
              System.out.println();
              for (String value: strings) {
                  System.out.println(value);
              }
          }
      }
    #+end_src

    #+RESULTS: pass-by-copy
    : First
    : Second
    : Third
    : 
    : Second
    : Third

